
var data=[];

var dataStr='1.霍比特人0<br/>\
<br/>\
导演：彼特·杰克逊<br/>\
编剧：彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊<br/>\
主演：彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/更多···<br/>\
类型：动作/奇幻/冒险<br/>\
制片国家：美国<br/>\
语言：英语<br/>\
上映时间：2015年<br/>\
片长：144分钟<br/>\
<br/>\
<br/>\
2.霍比特人1<br/>\
<br/>\
导演：彼特·杰克逊<br/>\
编剧：彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊<br/>\
主演：彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/更多···<br/>\
类型：动作/奇幻/冒险<br/>\
制片国家：美国<br/>\
语言：英语<br/>\
上映时间：2015年<br/>\
片长：144分钟<br/>\
<br/>\
<br/>\
3.霍比特人2<br/>\
<br/>\
导演：彼特·杰克逊<br/>\
编剧：彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊<br/>\
主演：彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/更多···<br/>\
类型：动作/奇幻/冒险<br/>\
制片国家：美国<br/>\
语言：英语<br/>\
上映时间：2015年<br/>\
片长：144分钟<br/>\
<br/>\
<br/>\
4.霍比特人3<br/>\
<br/>\
导演：彼特·杰克逊<br/>\
编剧：彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊<br/>\
主演：彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/更多···<br/>\
类型：动作/奇幻/冒险<br/>\
制片国家：美国<br/>\
语言：英语<br/>\
上映时间：2015年<br/>\
片长：144分钟<br/>\
<br/>\
<br/>\
5.霍比特人4<br/>\
<br/>\
导演：彼特·杰克逊<br/>\
编剧：彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊<br/>\
主演：彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/更多···<br/>\
类型：动作/奇幻/冒险<br/>\
制片国家：美国<br/>\
语言：英语<br/>\
上映时间：2015年<br/>\
片长：144分钟<br/>\
<br/>\
<br/>\
6.霍比特人5<br/>\
<br/>\
导演：彼特·杰克逊<br/>\
编剧：彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊<br/>\
主演：彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/更多···<br/>\
类型：动作/奇幻/冒险<br/>\
制片国家：美国<br/>\
语言：英语<br/>\
上映时间：2015年<br/>\
片长：144分钟<br/>\
<br/>\
<br/>\
7.霍比特人6<br/>\
<br/>\
导演：彼特·杰克逊<br/>\
编剧：彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊<br/>\
主演：彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/更多···<br/>\
类型：动作/奇幻/冒险<br/>\
制片国家：美国<br/>\
语言：英语<br/>\
上映时间：2015年<br/>\
片长：144分钟<br/>\
<br/>\
<br/>\
8.霍比特人7<br/>\
<br/>\
导演：彼特·杰克逊<br/>\
编剧：彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊<br/>\
主演：彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/更多···<br/>\
类型：动作/奇幻/冒险<br/>\
制片国家：美国<br/>\
语言：英语<br/>\
上映时间：2015年<br/>\
片长：144分钟<br/>\
<br/>\
<br/>\
9.霍比特人8<br/>\
<br/>\
导演：彼特·杰克逊<br/>\
编剧：彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊<br/>\
主演：彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/更多···<br/>\
类型：动作/奇幻/冒险<br/>\
制片国家：美国<br/>\
语言：英语<br/>\
上映时间：2015年<br/>\
片长：144分钟<br/>\
<br/>\
<br/>\
10.霍比特人9<br/>\
<br/>\
导演：彼特·杰克逊<br/>\
编剧：彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊<br/>\
主演：彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/彼特·杰克逊/更多···<br/>\
类型：动作/奇幻/冒险<br/>\
制片国家：美国<br/>\
语言：英语<br/>\
上映时间：2015年<br/>\
片长：144分钟<br/>\
';

var d=dataStr.split('<br/><br/><br/>');
for(var i=0;i<d.length;i++){
    var c=d[i].split('<br/><br/>');
    data.push({

        img:'images/'+i+'.jpg',
        caption:c[0].split('.')[1],
        desc:c[1]

    });

    //console.log(c[0].replace('.','')+'.jpg');
}




